<?php

/**
 * Константы
 */

namespace BrainGames\AppConstants;

/**
 *  Общие константы для всех игр
 */
const ROUNDS_COUNT = 3; // Количество раундов в каждой игре

/**
 * Константы для генерации случайного числа
 */
const MIN_FOR_RAND  = 1; // Минимальное значение для генерации случайного числа
const MAX_FOR_RAND  = 100; // Максимальное значение для генерации случайного числа

/**
 * Константы для генерации прогрессии
 */
const MIN_PROGRESSION_START = 1; // Минимальное значение для генерации случайного начального числа прогрессии
const MAX_PROGRESSION_START = 20; // Максимальное значение для генерации случайного начального числа прогрессии
const MIN_PROGRESSION_STEP = 1; // Минимальное значение для генерации случайного числа шага прогрессии
const MAX_PROGRESSION_STEP = 10; // Максимальное значение для генерации случайного числа шага прогрессии
const MIN_PROGRESSION_LENGTH = 5; // Минимальное значение для генерации случайного числа длины прогрессии
const MAX_PROGRESSION_LENGTH = 10; // Максимальное значение для генерации случайного числа длины прогрессии
